In [1]:
import pandas as pd
import numpy as np

In [2]:
train_data = pd.read_csv('data/train.csv')

In [3]:
test_data = pd.read_csv('data/test.csv')
gs_data = pd.read_csv('data/gender_submission.csv')

In [4]:
train_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
train_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
train_data.shape

(891, 12)

In [9]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
train_data['Age'].count()

714

In [13]:
#let's see unique values in Embarked
np.unique(train_data['Pclass'])

array([1, 2, 3], dtype=int64)

In [16]:
def unique_str (list):
    u_list = []
    for x in list:
        if x not in u_list:
            u_list.append(x)
    return u_list

In [19]:
unique_str(train_data['Embarked'])

['S', 'C', 'Q', nan]

In [20]:
#let's try it out with a simple model, without droping out na
from sklearn.tree import DecisionTreeRegressor
titanic_dtr_model = DecisionTreeRegressor(random_state=1)

In [24]:
#set up target and features
y = train_data.Survived
X = train_data.loc[:, train_data.columns != 'Survived']

In [26]:
X.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [27]:
#let's train the model
titanic_dtr_model.fit(X,y)

ValueError: could not convert string to float: 'Braund, Mr. Owen Harris'

In [32]:
#okay string does work with ml models, let's drop them
X = X.drop('Name',axis=1)

In [33]:
X.columns

Index(['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [42]:
#can I drop columns that are not integer?
X = X.select_dtypes(exclude='object')

In [44]:
#this is a very rough practice, now we have a all number dataframe, let's run the model
titanic_dtr_model.fit(X,y)

ValueError: Input contains NaN, infinity or a value too large for dtype('float32').

In [45]:
#okay, let's drop na
X.dropna()

     PassengerId  Pclass   Age  SibSp  Parch     Fare
0              1       3  22.0      1      0   7.2500
1              2       1  38.0      1      0  71.2833
2              3       3  26.0      0      0   7.9250
3              4       1  35.0      1      0  53.1000
4              5       3  35.0      0      0   8.0500
..           ...     ...   ...    ...    ...      ...
885          886       3  39.0      0      5  29.1250
886          887       2  27.0      0      0  13.0000
887          888       1  19.0      0      0  30.0000
889          890       1  26.0      0      0  30.0000
890          891       3  32.0      0      0   7.7500

[714 rows x 6 columns]

In [53]:
X.isnull().sum()

PassengerId      0
Pclass           0
Age            177
SibSp            0
Parch            0
Fare             0
dtype: int64

In [55]:
X = X.dropna()

In [56]:
#clear of NAs, let's run it again
titanic_dtr_model.fit(X,y)

ValueError: Number of labels=891 does not match number of samples=714

In [57]:
#okay, shouldnt do all the manipulations on feature data, X and y have different sizes, let's restart
train_data = train_data.dropna()
train_data = train_data.select_dtypes(exclude = 'object')

In [58]:
train_data.head()

    PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
1             2         1       1  38.0      1      0  71.2833
3             4         1       1  35.0      1      0  53.1000
6             7         0       1  54.0      0      0  51.8625
10           11         1       3   4.0      1      1  16.7000
11           12         1       1  58.0      0      0  26.5500

In [60]:
y = train_data.Survived
X = train_data.loc[:, train_data.columns != 'Survived']

In [61]:
titanic_dtr_model.fit(X,y)

DecisionTreeRegressor(ccp_alpha=0.0, criterion='mse', max_depth=None,
                      max_features=None, max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, presort='deprecated',
                      random_state=1, splitter='best')

In [63]:
#this is not right, but let's look at the result with the training feature data
titanic_dtr_model.predict(X.head())

array([1., 1., 0., 1., 1.])

In [64]:
train_data.head()

    PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
1             2         1       1  38.0      1      0  71.2833
3             4         1       1  35.0      1      0  53.1000
6             7         0       1  54.0      0      0  51.8625
10           11         1       3   4.0      1      1  16.7000
11           12         1       1  58.0      0      0  26.5500

In [66]:
#big data leakage problem, also we need a better way to test the result
from sklearn.metrics import mean_absolute_error
mean_absolute_error(y, titanic_dtr_model.predict(X))

0.0

In [67]:
#let's use val data to test the result
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [68]:
gs_data.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [70]:
test_data.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [72]:
test_data=test_data.dropna()

In [74]:
test_data = test_data.select_dtypes(exclude='object')

In [75]:
#just found that test data does not contain surival, need to merge the data from gs